analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_demo_cn0428_cn0429/src/cli.c
/**
******************************************************************************
*   @file     cli.c
*   @brief    Command Line Interface source file
*   @version  V0.1
*   @author   ADI
*
*******************************************************************************
*
*Copyright 2015-2018(c) Analog Devices, Inc.
*
*All rights reserved.
*
*Redistribution and use in source and binary forms, with or without modification,
*are permitted provided that the following conditions are met:
*    - Redistributions of source code must retain the above copyright
*      notice, this list of conditions and the following disclaimer.
*    - Redistributions in binary form must reproduce the above copyright
*      notice, this list of conditions and the following disclaimer in
*      the documentation and/or other materials provided with the
*      distribution.
*    - Neither the name of Analog Devices, Inc. nor the names of its
*      contributors may be used to endorse or promote products derived
*      from this software without specific prior written permission.
*    - The use of this software may or may not infringe the patent rights
*      of one or more patent holders.  This license does not release you
*      from the requirement that you obtain separate licenses from these
*      patent holders to use this software.
*    - Use of the software either in source or binary form, must be run
*      on or directly connected to an Analog Devices Inc. component.
*
*THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
*INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A
*PARTICULAR PURPOSE ARE DISCLAIMED.
*
*IN NO EVENT SHALL ANALOG DEVICES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
*EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, INTELLECTUAL PROPERTY
*RIGHTS, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
*BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
*STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
*THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************
**/

/***************************** Include Files **********************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>
#include "cli.h"
#include "ADuCM3029_demo_cn0428_cn0429.h"
#include "Ringbuffer.h"

/********************************* Definitions ********************************/



/************************** Variable Definitions ******************************/
/* Available commands */
char *CmdCommands[] = {
	"",
	"help",
	"defaultsensor",
	"sensorsconnected",
	"readconfigs",

	"readtemp",
	"readhum",
	"setmeastime",
	"startmeas",
	"stopmeas",
	"setrtia",
	"setrload",
	"setvbias",
	"setsensitivity",
	"runeis",
	"readeis",
	"readeisfull",
	"readrcal",
	"runpulse",
	"readpulse",
	"pulseamplitude",
	"pulseduration",
	"readsensors",
	"stopread",
	"setupdaterate",
	""
};

/* Functions for available commands */
cmdFunc CmdFun[] = {
	DoNothing,
	CmdHelp,
	SetDefaultSns,
	SnsConnected,
	RdCfgs,

	RdTemp,
	RdHum,
	CfgMeasTime,
	StartMeas,
	StopMeas,
	CfgRtia,
	CfgRload,
	CfgVbias,
	CfgSens,
	RunEIS,
	RdEIS,
	RdEISfull,
	RdRcal,
	RunPulse,
	ReadPulse,
	SetPulseAmpl,
	SetPulseDuration,
	RdSensors,
	StopRd,
	CfgUpdateRate,
	NULL
};



/*Local Variables */
uint8_t uiDefaultSite = 0;
uint8_t uiDefaultAddress = 0;
uint8_t uiPulseAmpl = 0;
uint8_t uiPulseDur = 0;
char strCmd[64] = "";

uint8_t		cmdReceived = 0;			// flag indicating user command has been received (ENTER pressed)

/****************************** Global functions ******************************/

//#pragma GCC diagnostic push
//#pragma GCC diagnostic ignored "-Wunused-parameter"

/**
   @brief Display info for <help> command

   @param args - pointer to the arguments on the command line.

   @return none
**/
void CmdHelp(uint8_t *args)
{
	UART_TX("help                           -Print commands"_EOS);
	UART_TX("defaultsensor <site>           -Set default sensor site"_EOS);
	UART_TX("                                  <site> = 1, 2, 3, 4"_EOS);
	UART_TX("sensorsconnected               -Print which sensors are connected"_EOS);
	UART_TX("readconfigs                    -Read sensor configurations"_EOS);
	UART_TX("readtemp                       -Read temperature from on-board sensor"_EOS);
	UART_TX("readhum                        -Read humidity from on-board sensor"_EOS);
	UART_TX("setmeastime <time>             -Set ADC sampling time in msec, default - 500"_EOS);
	UART_TX("                                  <time> = <50-32000>"_EOS);
	UART_TX("                                  ADC performs avg of 10 samples at this interval"_EOS);
	UART_TX("startmeas                      -Start ADC sampling at configured interval"_EOS);
	UART_TX("stopmeas                       -Stop ADC sampling the sensor"_EOS);
	UART_TX("setrtia <rtia>                 -Configure TIA resistance"_EOS);
	UART_TX("                                  <rtia> = <0-26> equals 0R - 512k"_EOS);
	UART_TX("                                  see user guide for detailed table"_EOS);
	UART_TX("setrload <rload>               -Configure sensor load resistor"_EOS);
	UART_TX("                                  <rload> = <0-7> equals 0R - 3k6"_EOS);
	UART_TX("                                  see user guide for detailed table"_EOS);
	UART_TX("setvbias <vbias>               -Configure sensor bias voltage"_EOS);
	UART_TX("                                  <vbias> = bias voltage in mV"_EOS);
	UART_TX("setsensitivity <sens>          -Configure sensitivity"_EOS);
	UART_TX("                                  <sens> = sensitivity in nA/ppm"_EOS);
	UART_TX("runeis                         -Run impedance spectroscopy"_EOS);
	UART_TX("readeis                        -Read impedance spectroscopy results"_EOS);
	UART_TX("readeisfull                    -Read impedance spectroscopy FULL results"_EOS);
	UART_TX("readrcal                       -Read 200R calibration resistor"_EOS);
	UART_TX("runpulse                       -Run pulse test. Set amplitude and duration first!"_EOS);
	UART_TX("readpulse                      -Read pulse test results"_EOS);
	UART_TX("pulseamplitude <ampl>          -Set amplitude for pulse test"_EOS);
	UART_TX("                                  <ampl> = amplitude in mV, 1 - 3 mV"_EOS);
	UART_TX("pulseduration <dur>            -Set duration for pulse test"_EOS);
	UART_TX("                                  <dur> = duration in ms, 10 to 200"_EOS);
	UART_TX("readsensors                    -Read the ppb value of all sensors"_EOS);
	UART_TX("setupdaterate <time>           -Configure update rate for stream mode"_EOS);
	UART_TX("stopread                       -Stop sensor data reading"_EOS);
	UART_TX("\r\n"_EOS);
}

/**
   @brief Finds the next command line argument

   @param args - pointer to the arguments on the command line.

   @return pointer to the next argument.

**/
uint8_t *FindArgv(uint8_t *args)
{
	uint8_t *p = args;
	int     fl = 0;

	while (*p != 0) {
		if ((*p == _SPC))
			fl = 1;
		else if (fl)
			break;
		p++;
	}

	return p;
}

/**
   @brief Separates a command line argument

