analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_demo_cn0428_cn0429/src/cli.c
    if (value > 26 || value < 0)
    {
    	value = 1;
    	UART_TX("Out of range! Set to default = 200 ohm"_EOS);
    }

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"CFG_RTIA%c%d", uiDefaultAddress, (uint16_t)value);
	CmdToRB(strCmd);
}

/**
   @brief Set sensor bias voltage

   @param args - pointer to the arguments on the command line.
					sensor bias: [mV] from -2200 to 2200

   @return none
**/
void CfgVbias(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount = 0;
	int32_t value = 0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	if (arg[0] == '-') digitcount++;
	//Check if arg is numeric
    for (i=0; arg[i] != '\0'; i++)
    {
        // check for decimal digits
        if (isdigit(arg[i]) != 0)
            digitcount++;
    }
    if(digitcount == i) //All characters are numeric
    	value = (int32_t) strtol(arg, (char **)NULL, 10); //convert string to number
    else
    	UART_TX("Invalid entry!"_EOS);

    if (value > 2200 || value < -2200)
    {
    	value = 0;
    	UART_TX("Out of range! Set to default = 0 mV"_EOS);
    }

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"CFG_VBIAS%c%ld", uiDefaultAddress, (int32_t)value);
	CmdToRB(strCmd);
}

/**
   @brief Configure sensor sensitivity

   @param args - pointer to the arguments on the command line.
					sensitivity: [nA/ppm]

   @return none
**/
void CfgSens(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount = 0;
	uint8_t  dotcount = 0;
	float 	 value = 0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	//Check if arg is numeric
	for (i=0; arg[i] != '\0'; i++)
	{
		// check for decimal digits
		if (isdigit(arg[i]) != 0)
			digitcount++;

		if (arg[i] == '.')
		{
			digitcount++;
			dotcount++;
		}
	}
	if(digitcount == i) //All characters are numeric
		value = strtof(arg, (char **)NULL); //convert string to number
	else
	{
		UART_TX("Invalid entry!"_EOS);
		return;
	}


	if(dotcount > 1)
	{
		UART_TX("Invalid entry!"_EOS);
		return;
	}

	if (value >= 32768 || value < 0)
	{
		UART_TX("Out of range!"_EOS);
		return;
	}

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"CFG_SENS%c%ld", uiDefaultAddress, (uint32_t)(value*100));
	CmdToRB(strCmd);
}

/**
   @brief Configure temperature compensation of sensor reading

   @param args - pointer to the arguments on the command line.
					temperature compensation: enabled/disabled

   @return none
**/
void CfgTempComp(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	if ((arg[0] == '0' || arg[0] == '1') && arg[1] == '\0')
	{
		memset(strCmd,'\0',sizeof(strCmd));
		sprintf(strCmd,"CFG_TEMPCOMP%c%c", uiDefaultAddress, arg[0]);
		CmdToRB(strCmd);

	}
	else
		UART_TX("Invalid entry! 0 or 1 allowed"_EOS);
}

/**
   @brief Start electrochemical impedance spectroscopy test

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RunEIS(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"RUN_EIS%c", uiDefaultAddress);
	CmdToRB(strCmd);
}

/**
   @brief Read electrochemical impedance spectroscopy results

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RdEIS(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"READ_EIS%c%s", uiDefaultAddress, _EOS);
	CmdToRB(strCmd);
}

/**
   @brief Read electrochemical impedance spectroscopy FULL results

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RdEISfull(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"READ_FULL_EIS%c%s", uiDefaultAddress, _EOS);
	CmdToRB(strCmd);
}

/**
   @brief Read the value of the 200R calibration resistor

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RdRcal(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"READ_RCAL%c%s", uiDefaultAddress, _EOS);
	CmdToRB(strCmd);
}

/**
   @brief Start chronoamperometry pulse test

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RunPulse(uint8_t *args)
{
	if (uiPulseAmpl != 0 && uiPulseDur != 0)
	{
		memset(strCmd,'\0',sizeof(strCmd));
		sprintf(strCmd,"RUN_PULSE%c%c%c", uiDefaultAddress, uiPulseAmpl, uiPulseDur);
		CmdToRB(strCmd);
	}
	else
	{
		UART_TX("Pulse and/or Duration not set!"_EOS);
	}
}

/**
   @brief Read results of chronoamperometry pulse test

   @param args - pointer to the arguments on the command line.

   @return none
**/
void ReadPulse(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"PULSE_RESULT%c%c%c", uiDefaultAddress, uiPulseAmpl, uiPulseDur);
	CmdToRB(strCmd);
}

/**
   @brief Set step amplitude for pulse test

   @param args - pointer to the arguments on the command line.
   	   amplitude: [mV] - Amplitude of the pulse in mV (typically 1mV)

   @return none
**/
void SetPulseAmpl(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount=0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	//Check if arg is numeric
	for (i=0; arg[i] != '\0'; i++)
	{
		// check for decimal digits
		if (isdigit(arg[i]) != 0)
			digitcount++;
	}
	if(digitcount == i) //All characters are numeric
		uiPulseAmpl = (uint8_t) strtol(arg, (char **)NULL, 10); //convert string to number
	else
	{
		UART_TX("Invalid entry!"_EOS);
		return;
	}

	if (uiPulseAmpl >= 3 || uiPulseAmpl < 1)
	{
		uiPulseAmpl = 1;
		UART_TX("Out of range! Set to default = 1 mV"_EOS);
		return;
	}

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"Pulse amplitude set to %d mV%s", uiPulseAmpl, _EOS);
	UART_TX((const char*)strCmd);
}

/**
   @brief Set duration for CAPA test

   @param args - pointer to the arguments on the command line.
   	   duration: [milliseconds] - Duration of the pulse (keep <200 ms)

   @return none
**/
void SetPulseDuration(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount=0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	//Check if arg is numeric
	for (i=0; arg[i] != '\0'; i++)
	{
		// check for decimal digits
		if (isdigit(arg[i]) != 0)
			digitcount++;
	}
	if(digitcount == i) //All characters are numeric
		uiPulseDur = (uint8_t) strtol(arg, (char **)NULL, 10); //convert string to number
	else
		UART_TX("Invalid entry!"_EOS);

	if (uiPulseDur > 200 || uiPulseDur < 1)
	{
		uiPulseDur = 50;
		UART_TX("Out of range! Set to default = 50 msec"_EOS);
	}

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"Pulse duration set to %d msec%s", uiPulseDur, _EOS);
	UART_TX((const char*)strCmd);
}

/**
   @brief Select sensor load resistor

   @param args - pointer to the arguments on the command line.
					Rtia: from 0 to 7 equals 0R - 3k6 , see user guide for details

   @return none
**/
void CfgRload(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount = 0;
	uint32_t value = 0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	//Check if arg is numeric
    for (i=0; arg[i] != '\0'; i++)
    {
        // check for decimal digits
        if (isdigit(arg[i]) != 0)
            digitcount++;
    }
    if(digitcount == i) //All characters are numeric
    	value = (uint8_t) strtol(arg, (char **)NULL, 10); //convert string to number
    else
    	UART_TX("Invalid entry!"_EOS);

    if (value > 7 || value < 0)
    {
    	value = 1;
    	UART_TX("Out of range! Set to default = 10 ohm"_EOS);
    }

	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"CFG_RLOAD%c%d", uiDefaultAddress, (uint16_t)value);
	CmdToRB(strCmd);
}

/**
   @brief Read the value of the configured load resistor

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RdRload(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"READ_RLOAD%c%s", uiDefaultAddress, _EOS);
	CmdToRB(strCmd);
}

/**
   @brief Read ppb value of all sensors

   @param args - pointer to the arguments on the command line.

   @return none
**/
void RdSensors(uint8_t *args)
{
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"READALLSENSORS");
	CmdToRB(strCmd);
}

/**
   @brief Stop reading sensor data

   @param args - pointer to the arguments on the command line.

   @return none
**/
void StopRd(uint8_t *args)
{
	FSM_State = COMMAND;
	streamTickCnt = 0;
	UART_TX("Data reading interrupted!"_EOS);
}

/**
   @brief Configure update rate in STREAM mode

   @param args - pointer to the arguments on the command line.

   @return none
**/
void CfgUpdateRate(uint8_t *args)
{
	uint8_t  *p = args;
	char     arg[17];
	uint8_t  i;
	uint8_t  digitcount = 0;
	uint32_t value = 0;

	/* Check if this function gets an argument */
	while (*(p = FindArgv(p)) != '\0') {
		/* Save channel parameter */
		GetArgv(arg, p);
	}

	//Check if arg is numeric
    for (i=0; arg[i] != '\0'; i++)
    {
        // check for decimal digits
        if (isdigit(arg[i]) != 0)
            digitcount++;
    }
    if(digitcount == i) //All characters are numeric
    	value = (uint8_t) strtol(arg, (char **)NULL, 10); //convert string to number
    else
    	UART_TX("Invalid entry!"_EOS);

    if (value > 3600 || value < 1)
    {
    	value = 1;
    	UART_TX("Out of range! Set to default = 1 sec"_EOS);
    }

    streamTickCfg = value;
	memset(strCmd,'\0',sizeof(strCmd));
	sprintf(strCmd,"Stream data update rate set to %d sec %s", streamTickCfg, _EOS);
	UART_TX(strCmd);
}






